public_html/Books Review/The C++ Programming Language/Errata.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Errata for The C++ Programming Language</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Errata for The C++ Programming Language"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-29 23:53:37 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Errata for The C++ Programming Language</h1>

<p><a href="http://www.math.pku.edu.cn/teachers/qiuzy/books/cppl/3rd_printing16.htm">http://www.math.pku.edu.cn/teachers/qiuzy/books/cppl/3rd_printing16.htm</a>
</p>

<p>
Errors and Clarifications
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Chapter 1:</a></li>
<li><a href="#sec-2">Chapter 2:</a></li>
<li><a href="#sec-3">Chapter 3:</a></li>
<li><a href="#sec-4">Chapter 6:</a></li>
<li><a href="#sec-5">Chapter 10:</a></li>
<li><a href="#sec-6">Chapter 14:</a></li>
<li><a href="#sec-7">Chapter 20:</a></li>
<li><a href="#sec-8">Appendix A:</a></li>
<li><a href="#sec-9">Appendix B:</a></li>
<li><a href="#sec-10">Appendix C:</a></li>
<li><a href="#sec-11">Appendix D:</a></li>
<li><a href="#sec-12">Appendix E:</a></li>
<li><a href="#sec-13">Typos</a>
<ul>
<li><a href="#sec-13-1">Chapter 4:</a></li>
<li><a href="#sec-13-2">Chapter 11:</a></li>
<li><a href="#sec-13-3">Appendix B:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Chapter 1:</h2>
<div class="outline-text-2" id="text-1">




<pre class="src src-c">pg 13 s/(<span style="color: #98fb98;">sec</span> <span style="color: #eedd82;">B</span>.2)/(with a few <span style="color: #98fb98;">minor</span> <span style="color: #eedd82;">exceptions</span>; see <span style="color: #98fb98;">sec</span> <span style="color: #eedd82;">B</span>.2)/
</pre>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Chapter 2:</h2>
<div class="outline-text-2" id="text-2">


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Chapter 3:</h2>
<div class="outline-text-2" id="text-3">


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Chapter 6:</h2>
<div class="outline-text-2" id="text-4">




<pre class="src src-c">pg 134: s/``does p point to a valid object,<span style="color: #ffa07a;">''</span>/ ``does p point to a valid object (assuming <span style="color: #98fb98;">proper</span> <span style="color: #eedd82;">initialization</span>),<span style="color: #ffa07a;">''</span>/
</pre>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Chapter 10:</h2>
<div class="outline-text-2" id="text-5">




<pre class="src src-c">pg 251 replace the middle example with

        <span style="color: #98fb98;">void</span> g()
        {
                vector&lt; Table&gt; v(10);                                   <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">no need for a delete</span>
                vector&lt; Table&gt;* p = new vector&lt; Table&gt;(10);     <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">use plain "delete" rather than "delete[]"</span>

                <span style="color: #98fb98;">delete</span> <span style="color: #eedd82;">p</span>;
        }
Using <span style="color: #98fb98;">a</span> <span style="color: #eedd82;">container</span>, <span style="color: #eedd82;">such</span> as vector, <span style="color: #eedd82;">is</span> simpler than writing a new/delete pair. Furthermore, <span style="color: #87cefa;">vector</span> provides exception safety (<span style="color: #98fb98;">Appendix</span> <span style="color: #eedd82;">E</span>).
Chapter 11: pg 290 replace the example using Y at the middle of the page by: Given a class Y <span style="color: #00ffff;">for</span> which -&gt;, *, and [] have their <span style="color: #00ffff;">default</span> meaning and a Y* called p then

        p-&gt;m == (*p).m          <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">is true</span>
        (*p).m == p[0].m        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">is true</span>
        p-&gt;m == p[0].m          <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">is true</span>
Chapter 13:
pg 335 s/<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span>[12]/<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span> v[12]/
</pre>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Chapter 14:</h2>
<div class="outline-text-2" id="text-6">




<pre class="src src-c">pg 369 better:

        X* p3 = new(&amp;buffer[10]) X;             <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">place X in buffer (no deallocation needed)</span>
        <span style="color: #98fb98;">X</span>* <span style="color: #eedd82;">p4</span> = new(&amp;buffer[11]) X[10];
Chapter 18:
pg 538 replace the second example with

For a call random_shuffle(b,e,r), the generator is called with the number of elements in the sequence as <span style="color: #98fb98;">its</span> <span style="color: #87cefa;">argument</span>: r(e-b). The generator must <span style="color: #00ffff;">return</span> a value in the range [0,e-b). If My_rand is such a generator, we might shuffle a deck of cards <span style="color: #98fb98;">like</span> <span style="color: #87cefa;">this</span>:

        <span style="color: #98fb98;">void</span> f(deque&lt; Card&gt;&amp; dc, My_rand&amp; r)
        {
                random_shuffle(dc.begin(),dc.end(),r);
                <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">...</span>
        }
</pre>

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Chapter 20:</h2>
<div class="outline-text-2" id="text-7">




<pre class="src src-c">pg 599: replace the last two declarations with:

        size_t strspn(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">p</span>, <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">q</span>);    <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">number of char in p before a char not in q</span>
        <span style="color: #98fb98;">size_t</span> <span style="color: #87cefa;">strcspn</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">p</span>, <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">q</span>);   <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">number of char in p before a char in q</span>
</pre>

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Appendix A:</h2>
<div class="outline-text-2" id="text-8">

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Appendix B:</h2>
<div class="outline-text-2" id="text-9">


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">Appendix C:</h2>
<div class="outline-text-2" id="text-10">




<pre class="src src-c">pg 895 s/: num_put/std::num_put/

pg 898 s/my_numpunct/My_punct/

pg 910 add before D.4.4.4: A _byname version (D.4, D.4.1) of time_put is <span style="color: #98fb98;">also</span> <span style="color: #eedd82;">provided</span>:

        template &lt; class Ch, <span style="color: #eedd82;">class</span> Out = ostreambuf_iterator&lt; Ch&gt; &gt;
        class std::time_put_byname : public time_put&lt; Ch,<span style="color: #eedd82;">Out</span>&gt; { <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">... </span><span style="color: #ff7f24;">*/</span> };
pg 912 s/time_put()/time_put::put()/ twice
pg 912 replace the last paragraph with: A _byname version (D.4, D.4.1) time_get is <span style="color: #98fb98;">also</span> <span style="color: #eedd82;">provided</span>:

        template &lt; class Ch, <span style="color: #eedd82;">class</span> In = istreambuf_iterator&lt; Ch&gt; &gt;
        class std::time_get_byname : public time_get&lt; Ch,<span style="color: #eedd82;">In</span>&gt; { <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">... </span><span style="color: #ff7f24;">*/</span> };
pg 915 s/Date_format&lt; <span style="color: #98fb98;">char</span>&gt;::/Date_format::/
pg 918 s/dateorder()/date_order()/

pg 919 s/order = dateorder();/order = date_order();/

pg 919 s/tmp-&gt;tm_mday = val[1];/tmp-&gt;tm_mday = val[2];/

pg 924 s/widen(narrow(<span style="color: #ffa07a;">'x'</span>)) == <span style="color: #ffa07a;">'x'</span>/widen(narrow(<span style="color: #ffa07a;">'x'</span>),0) == <span style="color: #ffa07a;">'x'</span>/

pg 926 s/out() encountered/in() encountered/

pg 928 add <span style="color: #ffa07a;">"char ch;"</span> before the <span style="color: #00ffff;">while</span>-statement
</pre>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">Appendix D:</h2>
<div class="outline-text-2" id="text-11">


</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">Appendix E:</h2>
<div class="outline-text-2" id="text-12">


</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">Typos</h2>
<div class="outline-text-2" id="text-13">



</div>

<div id="outline-container-13-1" class="outline-3">
<h3 id="sec-13-1">Chapter 4:</h3>
<div class="outline-text-3" id="text-13-1">

<p> pg 80 s/a vector/an array/
</p></div>

</div>

<div id="outline-container-13-2" class="outline-3">
<h3 id="sec-13-2">Chapter 11:</h3>
<div class="outline-text-3" id="text-13-2">

<p> pg 288 s/ of the array/of the vector/
</p>
</div>

</div>

<div id="outline-container-13-3" class="outline-3">
<h3 id="sec-13-3">Appendix B:</h3>
<div class="outline-text-3" id="text-13-3">


<p>
pg 817 s/Direction d = 1;/enum Direction d = 1;/
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-29 23:53:37 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
